bivex/ArchC/tests/nrf52/nrf52_arch_ref.H
/******************************************************
 * ArchC Resources header file.                       *
 * This file is automatically generated by ArchC      *
 * WITHOUT WARRANTY OF ANY KIND, either express       *
 * or implied.                                        *
 * For more information on ArchC, please visit:       *
 * http://www.archc.org                               *
 *                                                    *
 * The ArchC Team                                     *
 * Computer Systems Laboratory (LSC)                  *
 * IC-UNICAMP                                         *
 * http://www.lsc.ic.unicamp.br                       *
 ******************************************************/
 

#ifndef  _NRF52_ARCH_REF_H
#define  _NRF52_ARCH_REF_H

#include  "nrf52_parms.H"
#include  "ac_arch_ref.H"
#include  "ac_memport.H"
#include  "ac_reg.H"
#include  "ac_regbank.H"


//!Forward class declaration, needed to compile.
class nrf52_arch;

//!ArchC class for model-specific architectural resources.
class nrf52_arch_ref : public ac_arch_ref<nrf52_parms::ac_word, nrf52_parms::ac_Hword> {
public:
 
  //!Program Counter.
  ac_reg<unsigned>& ac_pc;

  //!Processor Id.
  ac_reg<unsigned>& ac_id;

  //!Storage Devices.
  ac_memport<nrf52_parms::ac_word, nrf52_parms::ac_Hword>& DM;
  ac_memport<nrf52_parms::ac_word, nrf52_parms::ac_Hword>& FLASH;
  ac_memport<nrf52_parms::ac_word, nrf52_parms::ac_Hword>& SRAM;
  ac_memport<nrf52_parms::ac_word, nrf52_parms::ac_Hword>& RADIO_PERIPH;
  ac_regbank<16, nrf52_parms::ac_word, nrf52_parms::ac_Dword>& R;
  ac_reg<nrf52_parms::ac_word>& xpsr;
  ac_reg<nrf52_parms::ac_word>& primask;
  ac_reg<nrf52_parms::ac_word>& control;
  ac_reg<nrf52_parms::ac_word>& event_reg;

  //!Constructor.
   nrf52_arch_ref(nrf52_arch& arch);

};

#endif  //_NRF52_ARCH_REF_H
